#pragma once

/***********************************************************************************************************
*
*	DrawInterface
*
*																				制作者：佐藤匠
*																				制作日：03/06
*
************************************************************************************************************
* モデルを読み込んで描画するクラス
************************************************************************************************************/

#include"Interface\DrawInterface.h"

class DrawModel : public DrawInterface::Device
{
private:



public:

	inline DrawModel() {}
	void Draw()override;

};